# git - это распределенная система контроля версий
" Это система для отслеживания и ведения истории изменения файлов в нашем проекте. При помощи git можно  организовать командную работу."
# GitHub - это веб - сайт для размещения git-репозиториев в совместной разработке проектов.
# Репозиторий - это хранилище нашего кода и истории его изменений

# Команды Git:
""" 
1. git init - создает удаленный репозиторий, в той директории, в которой была прописана команда.
2. git add . - это команда для добавления изменений в систему отслеживания гита.(вместо точки можно указать любую директорию)
3. git commit -m 'коментарий к комиту' - это команда для сохранения всех изменений с комментарием к ним.
4. git branch -M main - это команда переименовывает главную ветку master на main.
5. git remote add origin 'url' - это команда связывает наш локальный репозиторий с удаленным репозиторием на Githube
6. git status - статус версий
7. git push origin <main> - команда отправки наших изменений на удаленный репозиторий.
8. git branch - показывает на какой ветке находишься"""